pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/SAPH_A_367.0.xml
<module id="SAPH_A" HW_revision="367.0">
    <register id="SAPH_AIIDX" width="16" offset="0x0" internal="0" description="Interrupt Index">
        <bitfield id="IIDX" description="This register provides the highest priority enabled interrupt index." begin="3" end="1" width="3" rwaccess="R">
            <bitenum id="NONE" value="0x0" description="no interrupts pending"/>
            <bitenum id="DATAERR" value="0x1" description="This interrupt indicates that either WINHI interrupt or WINLO interrupt has occurred in SDHS."/>
            <bitenum id="TMFTO" value="0x2" description="This interrupt is valid when ASQ is activcve (auto mode). The interrupt indicates that the time counter in ASQ has reached to TIMEMARK_F (timeout)."/>
            <bitenum id="SEQDN" value="0x3" description="This interrupt is valid when ASQ is activcve (auto mode). The interrupt occurs when ASQ completes all of the measurements programmed in ASCTL0.PNGCNT. For example, when ASCTL0.PNGCNT = 3, total four measurements are performed. The interrupt indicates that all of the four measurements have been completed."/>
            <bitenum id="PNGDN" value="0x4" description="This interrupt is valid when ASQ is active (auto mode). The interrupt occurs when ASQ completes one measurement sequence. For example, when ASCTL0.PNGCNT = 3, total four measurements are performed. The interrupt indicates that one measurement has been completed."/>
        </bitfield>
    </register>
    <register id="SAPH_AMIS" width="16" offset="0x2" internal="0" description="Masked Interrupt Satus">
        <bitfield id="DATAERR" description="This interrupt indicates that either WINHI interrupt or WINLO interrupt has occurred in SDHS." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="TMFTO" description="This bit indicates a TIMEMARK F (timeout) event has happened." begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SEQDN" description="This interrupt is valid when ASQ is activcve (auto mode). The interrupt occurs when ASQ completes all of the measurements programmed in ASCTL0.PNGCNT. For example, when ASCTL0.PNGCNT = 3, total four measurements are performed. The interrupt indicates that all of the four measurements have been completed." begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PNGDN" description="This interrupt is valid when ASQ is active (auto mode). The interrupt occurs when ASQ completes one measurement sequence. For example, when ASCTL0.PNGCNT = 3, total four measurements are performed. The interrupt indicates that one measurement has been completed." begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="SAPH_ARIS" width="16" offset="0x4" internal="0" description="Raw Interrupt Status">
        <bitfield id="DATAERR" description="This interrupt indicates that either WINHI interrupt or WINLO interrupt has occurred in SDHS." begin="0" end="0" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="TMFTO" description="This bit indicates a TIMEMARK F (timeout) event has happened." begin="1" end="1" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="SEQDN" description="This interrupt is valid when ASQ is activcve (auto mode). The interrupt occurs when ASQ completes all of the measurements programmed in ASCTL0.PNGCNT. For example, when ASCTL0.PNGCNT = 3, total four measurements are performed. The interrupt indicates that all of the four measurements have been completed." begin="2" end="2" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="PNGDN" description="This interrupt is valid when ASQ is active (auto mode). The interrupt occurs when ASQ completes one measurement sequence. For example, when ASCTL0.PNGCNT = 3, total four measurements are performed. The interrupt indicates that one measurement has been completed." begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="DAV" description="This bit indicates a DMA access violation" begin="14" end="14" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="SAPH_AIMSC" width="16" offset="0x6" internal="0" description="Interrupt Mask">
        <bitfield id="DATAERR" description="This bit enables the DATAERR interrupt." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TMFTO" description="This bit enables the TIMEMARK F (timeout) interrupt." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQDN" description="This bit enables the SEQDN interrupt" begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PNGDN" description="This bit enables the PNGDN interrupt" begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DAV" description="This bit indicates a DMA access violation" begin="4" end="4" width="1" rwaccess="R">
        </bitfield>
    </register>
    <register id="SAPH_AICR" width="16" offset="0x8" internal="0" description="Interrupt Clear">
        <bitfield id="DATAERR" description="Writing one this bit to clear the pending DATAERR interrupt." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TMFTO" description="Writing one this bit to clear the pending TIMEMARK F (timeout) interrupt" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQDN" description="Writing one this bit to clear the pending SEQDN interrupt." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PNGDN" description="Writing one this bit to clear the pending PNGDN interrupt." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DAV" description="Writing one this bit to clear any previous DMA access violations" begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_AISR" width="16" offset="0xA" internal="0" description="Interrupt Set">
        <bitfield id="DATAERR" description="Writing one this bit generates a DATAERR interrupt by software." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TMFTO" description="Writing one this bit to generate a TIMEMARK F (timeout) interrupt by software." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SEQDN" description="Writing one this bit to generate a SEQDN interrupt by software." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PNGDN" description="Writing one this bit to generate a PNGDN interrupt by software." begin="3" end="3" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="DAV" description="Writing one this bit to set RIS.DAV by software." begin="14" end="14" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_ADESCLO" width="16" offset="0xC" internal="0" description="Module-Descriptor Low Word">
        <bitfield id="MINREV" description="Minor Revision" begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="MAJREV" description="Major Revision" begin="7" end="4" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="INSTNUM" description="Instance Number" begin="11" end="8" width="4" rwaccess="R">
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Version" begin="15" end="12" width="4" rwaccess="R">
        </bitfield>
    </register>
