pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/SAPH_A_367.0.xml
    <register id="SAPH_ADESCHI" width="16" offset="0xE" internal="0" description="Module-Descriptor High Word">
    </register>
    <register id="SAPH_AKEY" width="16" offset="0x10" internal="0" description="Key">
    </register>
    <register id="SAPH_AOCTL0" width="16" offset="0x12" internal="0" description="Physical Interface Output Control #0">
        <bitfield id="CH0OE" description="CH0_OUT Enable. When OSEL.PCH0SEL =0, this bit enables the output CH0 when set to 1. When OSEL.PCH0SEL != 0, this bit is invalid." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CH0OE_0" value="0x0" description="Ch0 Output is HiZ"/>
            <bitenum id="CH0OE_1" value="0x1" description="CH0 Output is driving"/>
        </bitfield>
        <bitfield id="CH1OE" description="CH1_OUT Enable. When OSEL.PCH1SEL =0, this bit enables the output CH1 when set to 1. When OSEL.PCH1SEL != 0, this bit is invalid." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="CH1OE_0" value="0x0" description="Ch1 Output is HiZ"/>
            <bitenum id="CH1OE_1" value="0x1" description="CH1 Output is driving"/>
        </bitfield>
        <bitfield id="CH0OUT" description="CH0_OUT Value. When OSEL.PCH0SEL =0 and OCTL0.CH0OE=1, this bit represents the logical value on the CH0 terminal.  0 = low 1 = high" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="CH0OUT_0" value="0x0" description="Ch0 is set to low signal"/>
            <bitenum id="CH0OUT_1" value="0x1" description="Ch0 is set to high signal"/>
        </bitfield>
        <bitfield id="CH1OUT" description="CH1_OUT Value. When OSEL.PCH1SEL =0 and OCTL0.CH1OE=1, this bit represents the logical value on the CH1 terminal.  0 = low 1 = high" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="CH1OUT_0" value="0x0" description="Ch1 is set to low signal"/>
            <bitenum id="CH1OUT_1" value="0x1" description="Ch1 is set to high signal"/>
        </bitfield>
    </register>
    <register id="SAPH_AOCTL1" width="16" offset="0x14" internal="0" description="Physical Interface Output Control #1">
        <bitfield id="CH0TERM" description="CH0 termination switch (SWG0) enable.  When OSEL.PCH0SEL =0, this bit controls the SWG0 switch.  0 = SWG0 is off.   1 = SWG0 is on. The CH0_OUT is disabled and connected to PVSS via SWG0 switch. No need to change OCTL0.CH0OE status." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CH0TERM_0" value="0x0" description="CH0 Output is defined by CH0OUT and CH0OE"/>
            <bitenum id="CH0TERM_1" value="0x1" description="CH0 Output is set low with termination strength"/>
        </bitfield>
        <bitfield id="CH1TERM" description="CH1 termination switch (SWG1) enable.  When OSEL.PCH1SEL =0, this bit controls the SWG1 switch.  0 = SWG1 is off.   1 = SWG1 is on. The CH1_OUT is disabled and connected to PVSS via SWG1 switch. No need to change OCTL0.CH1OE status." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="CH1TERM_0" value="0x0" description="CH1 Output is defined by CH1OUT and CH1OE"/>
            <bitenum id="CH1TERM_1" value="0x1" description="CH1 Output is set low with termination strength"/>
        </bitfield>
        <bitfield id="CH0FP" description="DRV0 (output driver on the CH0_OUT) full strength enable.  0 = The DRV0 output impedance is deterimed by CH0PUT and CH0PDT registers.  1 = The DRV0 has lowest output impedance." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="CH0FP_0" value="0x0" description="Ch0 Output is set to normal strength"/>
            <bitenum id="CH0FP_1" value="0x1" description="Ch0 Output is set to maximum strength"/>
        </bitfield>
        <bitfield id="CH1FP" description="DRV1 (output driver on the CH1_OUT) full strength enable.  0 = The DRV1 output impedance is deterimed by CH1PUT and CH1PDT registers.  1 = The DRV1 has lowest output impedance." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="CH1FP_0" value="0x0" description="Ch1 Output is set to normal strength"/>
            <bitenum id="CH1FP_1" value="0x1" description="Ch1 Output is set to maximum strength"/>
        </bitfield>
    </register>
    <register id="SAPH_AOSEL" width="16" offset="0x16" internal="0" description="Physical Interface Output Function Select">
        <bitfield id="PCH0SEL" description="Output functional select for CH0_OUT." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="GPIO" value="0x0" description="CH0_OUT is used as a GPO pin. It is controlled by OCTL0.CH0OUT and OCTL0.CH0OE."/>
            <bitenum id="PPGSE" value="0x1" description="CH0_OUT is driven by the PPG."/>
            <bitenum id="PCH0SEL_2" value="0x2" description="CH0_OUT is driven by the PPG as differential output along with CH1_OUT. (CH0_OUT and CH1_OUT are alwasy opposite polarity)"/>
            <bitenum id="PCH0SEL_3" value="0x3" description="CH0_OUT is used as a GPO pin. It is controlled by OCTL0.CH0OUT and OCTL0.CH0OE."/>
        </bitfield>
        <bitfield id="PCH1SEL" description="Output functional select for CH0_OUT." begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="GPIO" value="0x0" description="CH1_OUT is used as a GPO pin. It is controlled by OCTL0.CH1OUT and OCTL0.CH1OE."/>
            <bitenum id="PPGSE" value="0x1" description="CH1_OUT is driven by the PPG."/>
            <bitenum id="PCH1SEL_2" value="0x2" description="CH1_OUT is driven by the PPG as differential output along with CH0_OUT. (CH0_OUT and CH1_OUT are alwasy opposite polarity)"/>
            <bitenum id="PCH1SEL_3" value="0x3" description="CH1_OUT is used as a GPO pin. It is controlled by OCTL0.CH1OUT and OCTL0.CH1OE."/>
        </bitfield>
    </register>
    <register id="SAPH_ACH0PUT" width="16" offset="0x20" internal="0" description="Channel 0 Pull UpTrim Register">
        <bitfield id="CH0PUT" description="DRV0 pull up trim register. Write access is allowed only when TACR.UNLOCK=1. For secure the trim value, it is recommended to keep TACR.UNLOCK=0 during normal operation." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_ACH0PDT" width="16" offset="0x22" internal="0" description="Channel 0 Pull DownTrim Register">
        <bitfield id="CH0PDT" description="DRV0 pull down trim register. Write access is allowed only when TACR.UNLOCK=1. For secure the trim value, it is recommended to keep TACR.UNLOCK=0 during normal operation." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
