pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/SAPH_A_367.0.xml
    <register id="SAPH_ACH0TT" width="16" offset="0x24" internal="0" description="Channel 0 Termination Trim">
        <bitfield id="CH0TT" description="SWG0 trim register. Write access is allowed only when TACR.UNLOCK=1. For secure the trim value, it is recommended to keep TACR.UNLOCK=0 during normal operation." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_ACH1PUT" width="16" offset="0x26" internal="0" description="Channel 1 Pull UpTrim">
        <bitfield id="CH1PUT" description="DRV1 pull up trim register. Write access is allowed only when TACR.UNLOCK=1. For secure the trim value, it is recommended to keep TACR.UNLOCK=0 during normal operation." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_ACH1PDT" width="16" offset="0x28" internal="0" description="Channel 1 Pull DownTrim">
        <bitfield id="CH1PDT" description="DRV1 pull down trim register. Write access is allowed only when TACR.UNLOCK=1. For secure the trim value, it is recommended to keep TACR.UNLOCK=0 during normal operation." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_ACH1TT" width="16" offset="0x2A" internal="0" description="Channel 1 Termination Trim">
        <bitfield id="CH1TT" description="SWG1 trim register. Write access is allowed only when TACR.UNLOCK=1. For secure the trim value, it is recommended to keep TACR.UNLOCK=0 during normal operation." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_AMCNF" width="16" offset="0x2C" internal="0" description="Mode Configuration Register">
        <bitfield id="LPBE" description="LPBE, low power bias mode enable. This bit enables the low power bias operation mode. The selection of the operation mode shall only be changed while the PSQ is in OFF state (changes during other states of the PSQ causes corrupt measurement results and irregular triggers of sub modules ba ASQ)" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="LPBE_0" value="0x0" description="For manual bias mode and regular ASQ bias mode. In this configuration the user controls by the ASQBSW has full control over the TxBias and RxBias switches."/>
            <bitenum id="LPBE_1" value="0x1" description="Low power bias mode. In this mode the ASQ uses the CHxEBSW and PGABSW as auxiliary values to achieve faster channel setting on reactive input loads. The ASQ has full controls over the bias switch multiplexer."/>
        </bitfield>
        <bitfield id="RSV1" description="Reserved for future use" begin="10" end="9" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="CPEO" description="This bit enables the charge pump of the input multiplexer." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="CPEO_0" value="0x0" description="Charge pump is turned on by SDHS and ASQ related requests only."/>
            <bitenum id="CPEO_1" value="0x1" description="Charge pump is turned on regardless of SDHS and ASQ related charge pump requests."/>
        </bitfield>
        <bitfield id="RSV0" description="Reserved for future use" begin="3" end="2" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="BIMP" description="These bits define the impedance of the buffers for RxBias and TxBias. While for resistive loads the lowest impedance shows the fastest settling; is this not the case for reactive loads." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="BIMP_0" value="0x0" description="200 Ohms buffer impedance for RxBias and TxBias"/>
            <bitenum id="BIMP_1" value="0x1" description="600 Ohms buffer impedance for RxBias and TxBias"/>
            <bitenum id="BIMP_2" value="0x2" description="1200 Ohms buffer impedance for RxBias and TxBias (default)"/>
            <bitenum id="BIMP_3" value="0x3" description="2800 Ohms buffer impedance for RxBias and TxBias"/>
        </bitfield>
    </register>
    <register id="SAPH_ATACTL" width="16" offset="0x2E" internal="0" description="Trim Access Control">
        <bitfield id="UNLOCK" description="When UNLOCK = 1, the trim registers are allowed to be updated (CH0PUT, CH0PDT, CH0TT, CH1PUT, CH1PDT, and CH1TT)." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_AICTL0" width="16" offset="0x30" internal="0" description="Physical Interface Input Control #0">
        <bitfield id="MUXSEL" description="Input Multiplexer Channel Select" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="CH0IN" value="0x0" description="Channel 0 is selected for input"/>
            <bitenum id="CH1IN" value="0x1" description="Channel 1 is selected for input"/>
            <bitenum id="MUXSEL_2" value="0x2" description="reserved for future channels"/>
            <bitenum id="MUXSEL_3" value="0x3" description="reserved for future channels"/>
            <bitenum id="MUXSEL_4" value="0x4" description="reserved for future channels"/>
            <bitenum id="MUXSEL_5" value="0x5" description="reserved for future channels"/>
            <bitenum id="MUXSEL_6" value="0x6" description="reserved for future channels"/>
            <bitenum id="MUXSEL_7" value="0x7" description="reserved for future channels"/>
            <bitenum id="MUXSEL_8" value="0x8" description="no channel is selected"/>
            <bitenum id="MUXSEL_9" value="0x9" description="no channel is selected"/>
            <bitenum id="MUXSEL_10" value="0xA" description="no channel is selected"/>
            <bitenum id="MUXSEL_11" value="0xB" description="no channel is selected"/>
            <bitenum id="MUXSEL_12" value="0xC" description="no channel is selected"/>
            <bitenum id="MUXSEL_13" value="0xD" description="no channel is selected"/>
            <bitenum id="MUXSEL_14" value="0xE" description="no channel is selected"/>
            <bitenum id="MUXSEL_15" value="0xF" description="no channel is selected"/>
        </bitfield>
        <bitfield id="DUMEN" description="PGA dummy load enable on the deselected multiplexer inputs." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DUMEN_0" value="0x0" description="PGA dummy input load is Hi-Z."/>
            <bitenum id="DUMEN_1" value="0x1" description="PGA dummy input load matches the PGA input impedance."/>
        </bitfield>
        <bitfield id="MUXCTL" description="Input Multiplexer Control source" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="MUXCTL_0" value="0x0" description="The input multiplexer is controlled by ICTL0.MUXSEL (register mode)"/>
            <bitenum id="MUXCTL_1" value="0x1" description="The input multiplexer is controlled by ASQ (auto mode)"/>
        </bitfield>
        <bitfield id="XPBSW0" description="External PGA Bias Switch 0 control" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="XPBSW0_0" value="0x0" description="External bias switch is open (no bias driven)"/>
            <bitenum id="XPBSW0_1" value="0x1" description="External  bias switch is closed (bias is driven)"/>
        </bitfield>
        <bitfield id="XPBSW1" description="External PGA Bias Switch 1 control" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="XPBSW1_0" value="0x0" description="External bias switch is open (no bias driven)"/>
            <bitenum id="XPBSW1_1" value="0x1" description="External  bias switch is closed (bias is driven)"/>
        </bitfield>
        <bitfield id="XPB0FEN" description="XPB0 Pin Function Enable" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="XPB0FEN_0" value="0x0" description="XPB0 pin function disabled"/>
            <bitenum id="XPB0FEN_1" value="0x1" description="XPB0 pin function enabled"/>
        </bitfield>
        <bitfield id="XPB1FEN" description="XPB1 Pin Function Enable" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="XPB1FEN_0" value="0x0" description="XPB1 pin function disabled"/>
            <bitenum id="XPB1FEN_1" value="0x1" description="XPB1 pin function enabled"/>
        </bitfield>
    </register>
    <register id="SAPH_ABCTL" width="16" offset="0x34" internal="0" description="Bias Control">
        <bitfield id="ASQBSC" description="Tx bias and Rx bias switches control source select" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="ASQBSC_0" value="0x0" description="Bias switches are controlled by BCTL.CH0EBSW, BCTL.CH1EBSW, BCTL.PGABSW bits (register mode)."/>
            <bitenum id="ASQBSC_1" value="0x1" description="Bias switches are controlled by ASQ (auto mode)"/>
        </bitfield>
        <bitfield id="PGABSW" description="Rx bias (PGA bias) switch control. Note that the channel to apply the Rx bias is determined by ICTL0.MUXSEL." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="PGABSW_0" value="0x0" description="Rx bias switch is open."/>
            <bitenum id="PGABSW_1" value="0x1" description="Rx bias switch is closed (enabled)."/>
        </bitfield>
        <bitfield id="EXCBIAS" description="Excitation bias (Rx bias) Voltage Select" begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="EXCBIAS_0" value="0x0" description="0.2V nominal"/>
            <bitenum id="EXCBIAS_1" value="0x1" description="0.3V nominal"/>
            <bitenum id="EXCBIAS_2" value="0x2" description="0.4V nominal"/>
            <bitenum id="EXCBIAS_3" value="0x3" description="0.6V nominal"/>
        </bitfield>
        <bitfield id="PGABIAS" description="PGA bias (Rx bias) Voltage Select" begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="PGABIAS_0" value="0x0" description="0.75V nominal"/>
            <bitenum id="PGABIAS_1" value="0x1" description="0.8V nominal"/>
            <bitenum id="PGABIAS_2" value="0x2" description="0.9V nominal"/>
            <bitenum id="PGABIAS_3" value="0x3" description="0.95V nominal"/>
        </bitfield>
        <bitfield id="CH0EBSW" description="Channel 0 Tx bias Switch Control. Note that the Tx bias voltage is determined by BCTL.EXCBIAS." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="CH0EBSW_0" value="0x0" description="Tx bias switch to CH0 is open."/>
            <bitenum id="CH0EBSW_1" value="0x1" description="Tx bias switch to CH0 is closed (enabled)."/>
        </bitfield>
        <bitfield id="CH1EBSW" description="Channel 1 Tx bias Switch Control. Note that the Tx bias voltage is determined by BCTL.EXCBIAS." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="CH1EBSW_0" value="0x0" description="Tx bias switch to CH1 is open."/>
            <bitenum id="CH1EBSW_1" value="0x1" description="Tx bias switch to CH1 is closed (enabled)."/>
        </bitfield>
        <bitfield id="CPDA" description="Enable the power supply (Charge Pump) for the the input multiplexer during data acquisition." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="CPDA_0" value="0x0" description="Turn off the charge pump during data acquisition."/>
            <bitenum id="CPDA_1" value="0x1" description="Keep turning on the charge pump during data acquisition."/>
        </bitfield>
        <bitfield id="LILC" description="Line input leakage compensation (LILC) enable." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="LILC_0" value="0x0" description="LICL is disabled."/>
            <bitenum id="LILC_1" value="0x1" description="LICL is enabled."/>
        </bitfield>
    </register>
    <register id="SAPH_APGC" width="16" offset="0x40" internal="0" description="PPG Count">
        <bitfield id="EPULS" description="Excitation Pulse Count. This bit field defines the number of excitation pulses. Minimum value is zero." begin="6" end="0" width="7" rwaccess="R/W">
        </bitfield>
        <bitfield id="SPULS" description="Stop Pulse Count; This bit field defines the number of stop pulses. Minimum value is zero. Stop pulses have the inverted polarity of excitation pulses." begin="11" end="8" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="PPOL" description="Pulse Polarity. This bit defines the polarity of the first excitation pulse." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="PPOL_0" value="0x0" description="The excitation begins with logical high phase. The stop begines with logical low phase."/>
            <bitenum id="PPOL_1" value="0x1" description="The excitation begins with logical low phase. The stop begines with logical high phase."/>
        </bitfield>
        <bitfield id="PLEV" description="PPG ouptut level during inactive. This bit affects the status of PPG output before and after excitations. Note that this bit is only valid when PGC.PHIZ =0." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="PLEV_0" value="0x0" description="PPG output is low during inactive"/>
            <bitenum id="PLEV_1" value="0x1" description="PPG output is high during inactive"/>
        </bitfield>
        <bitfield id="PHIZ" description="Hi-Z enable to PPG output during inactive." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="PHIZ_0" value="0x0" description="PPG output during inactive is determined by PGC.PLEV bit."/>
            <bitenum id="PHIZ_1" value="0x1" description="PPG output is in Hi-Z during inactive regardless of PGC.PLEV bit."/>
        </bitfield>
    </register>
    <register id="SAPH_APGLPER" width="16" offset="0x42" internal="0" description="Pulse Generator Low Period">
        <bitfield id="LPER" description="Low phase period of PPG excitation pulses. This value defines the length of the low phase of the pulses. The minimum count is two regardless of the value set in this register." begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
