pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/SAPH_A_367.0.xml
    <register id="SAPH_APGHPER" width="16" offset="0x44" internal="0" description="Pulse Generator High Period">
        <bitfield id="HPER" description="High phase period of PPG excitation pulses. This value defines the length of the high phase of the pulses. The minimum count is two regardless of the value set in this register." begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_APGCTL" width="16" offset="0x46" internal="0" description="PPG Control">
        <bitfield id="PGSEL" description="PPG output channel select source." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="PGSEL_0" value="0x0" description="PPG output channel is selected by PGCTL.PPGCHSEL bit (register mode)."/>
            <bitenum id="PGSEL_1" value="0x1" description="PPG output channel is selected by ASQ (auto mode)."/>
        </bitfield>
        <bitfield id="PPGCHSEL" description="PPG output channel select when PGCTL.PGSEL = 0." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="PPGCHSEL_0" value="0x0" description="CH0 is selected"/>
            <bitenum id="PPGCHSEL_1" value="0x1" description="CH1 is selected"/>
        </bitfield>
        <bitfield id="TRSEL" description="PPG Trigger source select." begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="TRSEL_0" value="0x0" description="Writing 1 to PPGTRIG.PPGTRIG to trigger the PPG (start pulse generation)."/>
            <bitenum id="TRSEL_1" value="0x1" description="PPG trigger is controlled by the ASQ."/>
            <bitenum id="TRSEL_2" value="0x2" description="Ext. Signal (See device specific datasheet)"/>
            <bitenum id="TRSEL_3" value="0x3" description="Ext. Signal (See device specific datasheet)"/>
        </bitfield>
        <bitfield id="PPGEN" description="PPGEN PPG trigger enable. This bit can be used to indicates that the configuration of the pulse generator is complete. The PPG can only be started when this bit is set to 1 regardless of its trigger source. It is recommended to keep this bit zero while updating PPG registers." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="PPGEN_0" value="0x0" description="PPG trigger is disabled."/>
            <bitenum id="PPGEN_1" value="0x1" description="PPG trigger is enabled."/>
        </bitfield>
        <bitfield id="TONE" description="Tone generation enable. The frequency of the test tone is determined by LPER and HPER. The test tone persists while PGCTL.TONE = 1 &amp; PGCTL.STOP=0. Either writing 0 to PGCTL.TONE or writing 1  to PGCTL.STOP stops tone generation." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Test tone generation is disabled.  Note: This bit is automatically cleared when writing '1' to PGCTL.STOP, and it stops test tone generation immediately."/>
            <bitenum id="ENABLE" value="0x0" description="Test tone generation is enabled."/>
        </bitfield>
        <bitfield id="PPGSTOP" description="Writing one to this bit stopps the PPG to generate pulses. This bit is cleared automatically." begin="15" end="15" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PSCEN" description="PPG pre scaler enable." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Prescaler is disabled. PPG clock = PLL output clock."/>
            <bitenum id="ENABLE" value="0x1" description="Prescaler by four is enabled. PPG clock = 1/4 of the PLL output clock."/>
        </bitfield>
    </register>
    <register id="SAPH_APPGTRIG" width="16" offset="0x48" internal="0" description="PPG Software Trigger">
        <bitfield id="PPGTRIG" description="Writing '1' to this bit triggers the PPG to generate pulses when PGCTL.TRSEL =0.    Note: This bit is write only. Reading always returns with zero." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_AXPGCTL" width="16" offset="0x4A" internal="0" description="Extended Pulse Control Register">
        <bitfield id="XPULS" description="XPULS Extra Pulse Count; This bit field defines the count of extra excitation pulses excited. If set to zero no extra excitation pulses are generated. Directly after the start the regular excitation  phase is entered. Any other number will generate up the number of excitation pulses set by this field ." begin="6" end="0" width="7" rwaccess="R/W">
        </bitfield>
        <bitfield id="XSTAT" description="Phase Status of PPG" begin="9" end="8" width="2" rwaccess="R">
            <bitenum id="XSTAT_0" value="0x0" description="PPG in Pause Phase"/>
            <bitenum id="XSTAT_1" value="0x1" description="PPG in Stop Phase"/>
            <bitenum id="XSTAT_2" value="0x2" description="PPG in Regular Excitation phase"/>
            <bitenum id="XSTAT_3" value="0x3" description="PPG in Extra Excitation Phase"/>
        </bitfield>
        <bitfield id="XMOD" description="Extended Mode Select" begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="XMOD_0" value="0x0" description="Single tone generation (Pause-E-S-Pause)"/>
            <bitenum id="XMOD_1" value="0x1" description="reserved"/>
            <bitenum id="XMOD_2" value="0x2" description="Dual Tone Generation (Pause-X-E-S-Pause)"/>
            <bitenum id="XMOD_3" value="0x3" description="Dual Tone Loop (X-E-X-E triggers events)"/>
        </bitfield>
        <bitfield id="ETY" description="Event type. Selects the type of the event generated in XMOD=3" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="ETY_0" value="0x0" description="Timer count event"/>
            <bitenum id="ETY_1" value="0x1" description="DMA trigger event"/>
        </bitfield>
    </register>
    <register id="SAPH_AXPGLPER" width="16" offset="0x4C" internal="0" description="Extra Pulse Low Period Register">
        <bitfield id="XLPER" description="XLPER low phase period of the extra pulses. This value defines the length of the low phase of the extra pulses in units of high speed clocks. The minimum count is two regardless of the value set in this register." begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_AXPGHPER" width="16" offset="0x4E" internal="0" description="Extra Pulse High Period Register">
        <bitfield id="XHPER" description="XHPER high phase period of the extra pulses. This value defines the length of the high phase of the pulses in units of high speed clocks. The minimum count is two  regardless of the value set in this register." begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_AASCTL0" width="16" offset="0x60" internal="0" description="A-SEQ control register 0">
        <bitfield id="PNGCNT" description="The total number of measurements to be performed.  0 = 1 measurement will be performed (Min) 1 = 2 measurements will be performed 2 = 3 measurements will be performed 3 = 4 measurements will be performed (Max) Note: This bit field is static, does not reflect the currently reamining measurement numbers." begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="ASQCHSEL" description="This bit selects the channel to start with when ASQ contols the measuremnet sequences." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="ASQCHSEL_0" value="0x0" description="CH0 is selected to start with.  If ASCTL0.PNGCNT = 3 and ASCTL1.CHTOG =1, then the channel selection would be CH0 - CH1 - CH0 - CH1. If ASCTL0.PNGCNT = 3 and ASCTL1.CHTOG =0, then the channel selection would be CH0 - CH0 - CH0 - CH0."/>
            <bitenum id="ASQCHSEL_1" value="0x1" description="CH1 is selected to start with.  If ASCTL0.PNGCNT = 3 and ASCTL1.CHTOG =0, then the channel selection would be CH1 - CH1 - CH1 - CH1. If ASCTL0.PNGCNT = 3 and ASCTL1.CHTOG =1, then the channel selection would be CH1 - CH0 - CH1 - CH0."/>
        </bitfield>
        <bitfield id="ASQSTOP" description="Stop the ASQ. Writing '1' to this bit stops the measurement sequence controlled by the ASQ.  This bit is self cleared." begin="7" end="7" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="ASQTEN" description="ASQ Trigger Enable. This bit can be used to indicate that the configuration of the ASQ is complete. The ASQ can only be triggered when this bit is set to '1' regardless of its trigger source. It is recommended to keep this bit zero while updating ASQ registerds." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="ASQEN_0" value="0x0" description="ASQ trigger is disabled."/>
            <bitenum id="ASQEN_1" value="0x1" description="ASQ trigger is enabled."/>
        </bitfield>
        <bitfield id="TRIGSEL" description="ASQ trigger select." begin="11" end="10" width="2" rwaccess="R/W">
            <bitenum id="SWTRIG" value="0x0" description="Writing '1' to ASQTRIG.ASQTRIG"/>
            <bitenum id="PSQ" value="0x1" description="The PSQ is selected to start the ASQ."/>
            <bitenum id="TIMER" value="0x2" description="Ext. Signal (See device specific datasheet)"/>
            <bitenum id="TRIGSEL_3" value="0x3" description="Ext. Signal (See device specific datasheet)"/>
        </bitfield>
        <bitfield id="ERABRT" description="Stop ASQ when the DATAERR interrupt occurrs when the mesurements controlled by ASQ (auto mode). Note that it is not possible to resume the measurement from where it was stopped. When ASQ is triggered again, the measurement seqeunce starts from the beginning." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="ERABRT_0" value="0x0" description="Continue the measurements until completion regardless of the DATAERR interrupt."/>
            <bitenum id="ERABRT_1" value="0x1" description="Stop the ASQ upon the DATAERR interrupt."/>
        </bitfield>
    </register>
