pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/SAPH_A_367.0.xml
    <register id="SAPH_AASCTL1" width="16" offset="0x62" internal="0" description="A-SEQ control register 1">
        <bitfield id="CHTOG" description="Channel toggle enable at each PNGDN interrupt." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CHTOG_0" value="0x0" description="Channel toggle is disabled."/>
            <bitenum id="CHTOG_1" value="0x1" description="Channel toggle is enabled at each PNGDN interrupt."/>
        </bitfield>
        <bitfield id="CHACT" description="Read Only bit. This bit indicates the currently selected Tx channel." begin="4" end="4" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="EARLYRB" description="Early Receive Bias Control. The Rx bias is applied at the TIMEMARK C, but when this bit is set to '1', the Rx bias is applied at the TIMEMARK A." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="EARLYRB_0" value="0x0" description="Rx bias is applied to the Rx channel by the TIMEMARK C"/>
            <bitenum id="EARLYRB_1" value="0x1" description="Rx bias is applied to the Rx channel by the TIMEMARK A"/>
        </bitfield>
        <bitfield id="ESOFF" description="Enable the OFF request when ASQ completes all of the measurement sequences." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="ESOFF_0" value="0x0" description="OFF request is disabled. The ASQ does not send a request about USS power mode to the PSQ."/>
            <bitenum id="ESOFF_1" value="0x1" description="OFF request is generated after sequence"/>
        </bitfield>
        <bitfield id="STDBY" description="ASQ can send a request sigal to the PSQ (Power Sequencer) of the USS module when the OFF request is received (See ASCTL1.ESOFF and the UUPS module)." begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="PWROFF" value="0x0" description="The ASQ sends a power down request to the PSQ (Power Sequencer) when the OFF request is received."/>
            <bitenum id="STDBY" value="0x1" description="The ASQ sends a standby request to the PSQ (Power Sequencer) when the OFF request is received."/>
        </bitfield>
        <bitfield id="CHOWN" description="In general, if CH0 is selected for Tx, CH1 is selected for Rx. However, when this bit is set to '1', the Tx channel and Rx channel are identical. This bit can be used for debugging purpose." begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="CHOWN_0" value="0x0" description="Tx channel and Rx channel are not the same (This is the typical configuration)."/>
            <bitenum id="CHOWN_1" value="0x1" description="Tx channel and Rx channel are identical."/>
        </bitfield>
    </register>
    <register id="SAPH_AASQTRIG" width="8" offset="0x64" internal="0" description="ASQ Software Trigger">
        <bitfield id="ASQTRIG" description="Writing '1' to this bit trigger the ASQ when ASCTL0.TRIGSEL = 0. Note: This bit is write only. Reading always returns with zero." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_AAPOL" width="16" offset="0x66" internal="0" description="ASQ ping output polarity">
        <bitfield id="PCPOL" description="Bit 0 defines the PPG pulse polarity for the first measurement.  Bit 1 defines the PPG pulse polarity for the second measurement.  Bit 2 defines the PPG pulse polarity for the third measurement.  Bit 3 defines the PPG pulse polarity for the fourth measurement.   0 = PPG output pulses starts with logical high polarity. 1 = PPG output pulses starts with logical low polarity." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_AAPLEV" width="16" offset="0x68" internal="0" description="ASQ ping pause level">
        <bitfield id="PCPLEV" description="Bit 0 defines the PPG output level at pause for the first measurement when PCPHIZ bit 0 = 0. Bit 1 defines the PPG output level at pause for the second measurement when PCPHIZ bit 1 = 0. Bit 2 defines the PPG output level at pause for the third measurement when PCPHIZ bit 2 = 0. Bit 3 defines the PPG output level at pause for the fourth measurement when PCPHIZ bit 3 = 0.   0 = Logical Low. 1 = Logical High." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_AAPHIZ" width="16" offset="0x6A" internal="0" description="ASQ ping pause impedance">
        <bitfield id="PCPHIZ" description="Bit 0 defines the PPG output status at pause for the first measurement.  Bit 1 defines the PPG output status at pause for the second measurement.  Bit 2 defines the PPG output status at pause for the third measurement.  Bit 3 defines the PPG output status at pause for the fourth measurement.   0 = PPG ouput level is determined by APLEV.PCPLEV bits 1 = Hi-z. regardless of APLEV.PCPLEV bits" begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_AATM_A" width="16" offset="0x6E" internal="0" description="A-SEQ start to 1st ping">
    </register>
    <register id="SAPH_AATM_B" width="16" offset="0x70" internal="0" description="ASQ start to ADC arm">
    </register>
    <register id="SAPH_AATM_C" width="16" offset="0x72" internal="0" description="Count for the TIMEMARK C Event">
    </register>
    <register id="SAPH_AATM_D" width="16" offset="0x74" internal="0" description="ASQ start to ADC trig">
    </register>
    <register id="SAPH_AATM_E" width="16" offset="0x76" internal="0" description="ASQ start to restart">
    </register>
    <register id="SAPH_AATM_F" width="16" offset="0x78" internal="0" description="ASQ start to timeout">
    </register>
    <register id="SAPH_ATBCTL" width="16" offset="0x7A" internal="0" description="Time Base Control">
        <bitfield id="TCLR" description="The ASQ time counter clear. Writing '1' to this bit clears the the counter value. The counter must be stopped prior to be cleared. This bit is self cleared. TSTOP, TSTART, and TCLR bits are offerred for only debugging purpose. It is not recommend to use this bit while ASQ is active. Note: This bit is write only. Reading always returns with zero." begin="0" end="0" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TSTART" description="The ASQ time counter start. Writing '1' to this bit starts the counter. This bit is self cleared. TSTOP, TSTART, and TCLR bits are offerred for only debugging purpose. It is not recommend to use this bit while ASQ is active. Note: This bit is write only. Reading always returns with zero." begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="TSTOP" description="The ASQ time counter stop. Writing '1' to this bit stops the counter. This bit is self cleared. TSTOP, TSTART, and TCLR bits are offerred for only debugging purpose. It is not recommend to use this bit while ASQ is active. Note: This bit is write only. Reading always returns with zero." begin="2" end="2" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="PSSV" description="ASQ pre-scaler shift. The value written to the PSSV bits shifts the start point of the ASQ's pre-scaler. Note that the value only affects the first cycle of the pre-scaler.   0 = No shift 1 = The pre-scaler starts 1 clock later  2 = The pre-scaler starts 2 clocks later  ... 15 = The pre-scaler starts 15 clocks later" begin="7" end="4" width="4" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SAPH_AATIMLO" width="16" offset="0x7C" internal="0" description="Acquisition Timer Low Part">
    </register>
    <register id="SAPH_AATIMHI" width="16" offset="0x7E" internal="0" description="Acquisition Timer High Part">
        <bitfield id="ATIMHI" description="ASQ Timer Counter high part. The reading this register returns the counter value [19:16]." begin="3" end="0" width="4" rwaccess="R">
        </bitfield>
    </register>
</module>
